import React from "react";

import {ObjectPageBlockTextWrapper} from "../";

interface ObjectPageAboutProps {
    description: string;
}

const ObjectPageAbout: React.FC<ObjectPageAboutProps> = ({description}) => {
    const ObjectPageSectionAboutTextRef = React.useRef<HTMLDivElement>(null);

    const [totalHeight, setTotalHeight] = React.useState(0);

    React.useEffect(() => {
        if (ObjectPageSectionAboutTextRef.current) {
            setTotalHeight(ObjectPageSectionAboutTextRef.current?.offsetHeight);
        }
    }, [ObjectPageSectionAboutTextRef]);

    return (
        <div
            className="object-page-section object-page-section-about"
            id="object-page-about"
        >
            <div className="object-page-section-padding">
                <div className="object-page-section-about-text">
                    <ObjectPageBlockTextWrapper
                        isFullHeight={totalHeight < 350 ? true : false}
                    >
                        <div
                            className="object-page-section-about-text-wrapper"
                            ref={ObjectPageSectionAboutTextRef}
                        >
                            <h2 className="object-page-section__title">
                                Об отеле
                            </h2>
                            <p className="object-page-section__description">
                                {description}
                            </p>
                        </div>
                    </ObjectPageBlockTextWrapper>
                </div>
                {/* <div className="object-page-section-about-services">
                    <div className="object-page-section-about-services-block-wrapper">
                        <div className="object-page-section-about-services-block">
                            <h3 className="object-page-section-about-services-block__title">
                                В отеле
                            </h3>
                            <div className="object-page-section-about-services-block-list">
                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 22 16"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M1 6.00025C7 -0.66675 15 -0.66675 21 6.00025M5 10.0002C8.6 6.00025 13.4 6.00025 17 10.0002"
                                            stroke="#116E67"
                                            strokeWidth="2"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                        <path
                                            d="M11 15C11.5523 15 12 14.5523 12 14C12 13.4477 11.5523 13 11 13C10.4477 13 10 13.4477 10 14C10 14.5523 10.4477 15 11 15Z"
                                            stroke="#116E67"
                                            strokeWidth="2"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    WI-FI на всей территории объекта
                                </p>

                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 22 16"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M16.6625 5.75L16.4615 5.678L14.759 2.486C14.4392 1.88614 13.9624 1.38447 13.3796 1.03466C12.7967 0.684844 12.1298 0.500036 11.45 0.5H7.163C6.37576 0.499968 5.60848 0.74769 4.96988 1.20806C4.33128 1.66843 3.85377 2.3181 3.605 3.065L2.7935 5.4995C2.11363 5.78606 1.5334 6.2668 1.12544 6.88154C0.717477 7.49628 0.49992 8.21771 0.5 8.9555V10.625C0.5 11.69 1.1345 12.605 2.045 13.0175C2.16291 13.6931 2.50871 14.3078 3.02482 14.7594C3.54092 15.211 4.19616 15.4722 4.8814 15.4993C5.56664 15.5265 6.24051 15.3181 6.79077 14.9088C7.34102 14.4996 7.73444 13.9141 7.9055 13.25H14.0945C14.2656 13.9141 14.659 14.4996 15.2092 14.9088C15.7595 15.3181 16.4334 15.5265 17.1186 15.4993C17.8038 15.4722 18.4591 15.211 18.9752 14.7594C19.4913 14.3078 19.8371 13.6931 19.955 13.0175C20.4154 12.8097 20.8061 12.4734 21.0802 12.049C21.3542 11.6246 21.5 11.1302 21.5 10.625V10.1165C21.4999 9.34238 21.2602 8.58727 20.8138 7.9548C20.3675 7.32232 19.7363 6.84348 19.007 6.584L16.742 5.7785V5.75H16.6625ZM7.163 2H8.75V5.75H4.2905L5.027 3.539C5.17633 3.09067 5.46302 2.70072 5.84642 2.42448C6.22981 2.14824 6.69045 1.99973 7.163 2ZM10.25 2H11.45C11.8579 1.99985 12.2582 2.1106 12.608 2.32038C12.9578 2.53017 13.244 2.8311 13.436 3.191L14.801 5.75H10.25V2ZM16.4045 7.25L18.5045 7.997C18.942 8.15274 19.3207 8.44006 19.5884 8.81954C19.8562 9.19902 20 9.65207 20 10.1165V10.625C20 10.8875 19.91 11.129 19.76 11.321C19.5143 10.7443 19.0941 10.259 18.5585 9.9334C18.0228 9.60776 17.3986 9.45809 16.7735 9.50543C16.1485 9.55276 15.5539 9.79471 15.0734 10.1973C14.5929 10.5999 14.2506 11.1429 14.0945 11.75H7.9055C7.74944 11.1429 7.40711 10.5999 6.9266 10.1973C6.4461 9.79471 5.85155 9.55276 5.22647 9.50543C4.60139 9.45809 3.97719 9.60776 3.44154 9.9334C2.90589 10.259 2.4857 10.7443 2.24 11.321C2.08389 11.1227 1.99932 10.8774 2 10.625V8.9555C2 8.2805 2.3 7.6655 2.78 7.25H16.4045ZM3.5 12.5C3.5 12.1022 3.65804 11.7206 3.93934 11.4393C4.22064 11.158 4.60218 11 5 11C5.39782 11 5.77936 11.158 6.06066 11.4393C6.34196 11.7206 6.5 12.1022 6.5 12.5C6.5 12.8978 6.34196 13.2794 6.06066 13.5607C5.77936 13.842 5.39782 14 5 14C4.60218 14 4.22064 13.842 3.93934 13.5607C3.65804 13.2794 3.5 12.8978 3.5 12.5ZM17 11C17.3978 11 17.7794 11.158 18.0607 11.4393C18.342 11.7206 18.5 12.1022 18.5 12.5C18.5 12.8978 18.342 13.2794 18.0607 13.5607C17.7794 13.842 17.3978 14 17 14C16.6022 14 16.2206 13.842 15.9393 13.5607C15.658 13.2794 15.5 12.8978 15.5 12.5C15.5 12.1022 15.658 11.7206 15.9393 11.4393C16.2206 11.158 16.6022 11 17 11Z"
                                            fill="#116E67"
                                        />
                                    </svg>
                                    Трансфер в любую точку города{" "}
                                    <span>(платно)</span>
                                </p>

                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 24 11"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M17.6246 0.25C16.9293 0.252765 16.2632 0.530214 15.7715 1.0219C15.2798 1.51358 15.0024 2.17966 14.9996 2.875C14.9996 4.3165 16.1831 5.5 17.6246 5.5C19.0661 5.5 20.2496 4.3165 20.2496 2.875C20.2496 1.4335 19.0661 0.25 17.6246 0.25ZM10.2889 0.27325C10.0095 0.29086 9.74105 0.388494 9.51562 0.5545L5.55412 3.39025L6.44513 4.60975L10.3826 1.77325L12.0934 3.742L6.53888 8.45275C6.84338 8.47975 7.16888 8.5 7.49963 8.5C8.00663 8.5 8.49263 8.4475 8.97638 8.359L13.0541 4.867L14.5781 6.625C15.1391 6.47288 15.7107 6.36307 16.2881 6.2965L11.5076 0.78925C11.3594 0.613435 11.1718 0.475076 10.96 0.385417C10.7482 0.295757 10.5183 0.257327 10.2889 0.27325V0.27325ZM17.6246 1.75C18.2546 1.75 18.7496 2.245 18.7496 2.875C18.7496 3.508 18.2546 4 17.6246 4C17.4763 4.00202 17.3291 3.9743 17.1917 3.91848C17.0543 3.86265 16.9295 3.77986 16.8246 3.67499C16.7198 3.57012 16.637 3.4453 16.5812 3.30789C16.5253 3.17049 16.4976 3.0233 16.4996 2.875C16.4996 2.245 16.9916 1.75 17.6246 1.75ZM17.2496 7C15.4211 7 13.8191 7.612 12.2576 8.17225C10.6961 8.731 9.17513 9.25 7.49963 9.25C3.37763 9.25 1.26488 7.21075 1.26488 7.21075L0.234375 8.29C0.234375 8.29 2.86238 10.75 7.49963 10.75C9.48338 10.75 11.1791 10.1433 12.7496 9.57775C14.3201 9.013 15.7616 8.5 17.2496 8.5C20.2264 8.5 22.7576 10.5858 22.7576 10.5858L23.7416 9.41425C23.7416 9.41425 20.9059 7 17.2496 7Z"
                                            fill="#116E67"
                                        />
                                    </svg>
                                    Открытый бассейн
                                </p>

                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 24 11"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M17.6246 0.25C16.9293 0.252765 16.2632 0.530214 15.7715 1.0219C15.2798 1.51358 15.0024 2.17966 14.9996 2.875C14.9996 4.3165 16.1831 5.5 17.6246 5.5C19.0661 5.5 20.2496 4.3165 20.2496 2.875C20.2496 1.4335 19.0661 0.25 17.6246 0.25ZM10.2889 0.27325C10.0095 0.29086 9.74105 0.388494 9.51562 0.5545L5.55412 3.39025L6.44513 4.60975L10.3826 1.77325L12.0934 3.742L6.53888 8.45275C6.84338 8.47975 7.16888 8.5 7.49963 8.5C8.00663 8.5 8.49263 8.4475 8.97638 8.359L13.0541 4.867L14.5781 6.625C15.1391 6.47288 15.7107 6.36307 16.2881 6.2965L11.5076 0.78925C11.3594 0.613435 11.1718 0.475076 10.96 0.385417C10.7482 0.295757 10.5183 0.257327 10.2889 0.27325V0.27325ZM17.6246 1.75C18.2546 1.75 18.7496 2.245 18.7496 2.875C18.7496 3.508 18.2546 4 17.6246 4C17.4763 4.00202 17.3291 3.9743 17.1917 3.91848C17.0543 3.86265 16.9295 3.77986 16.8246 3.67499C16.7198 3.57012 16.637 3.4453 16.5812 3.30789C16.5253 3.17049 16.4976 3.0233 16.4996 2.875C16.4996 2.245 16.9916 1.75 17.6246 1.75ZM17.2496 7C15.4211 7 13.8191 7.612 12.2576 8.17225C10.6961 8.731 9.17513 9.25 7.49963 9.25C3.37763 9.25 1.26488 7.21075 1.26488 7.21075L0.234375 8.29C0.234375 8.29 2.86238 10.75 7.49963 10.75C9.48338 10.75 11.1791 10.1433 12.7496 9.57775C14.3201 9.013 15.7616 8.5 17.2496 8.5C20.2264 8.5 22.7576 10.5858 22.7576 10.5858L23.7416 9.41425C23.7416 9.41425 20.9059 7 17.2496 7Z"
                                            fill="#116E67"
                                        />
                                    </svg>
                                    Крытый бассейн
                                </p>

                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 18 20"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M9 6.68421V10.4737M1.02178 11.6266C0.992065 11.4881 0.992765 11.3444 1.02383 11.2061C1.05489 11.0679 1.11552 10.9387 1.20123 10.828C1.28695 10.7173 1.39556 10.628 1.51904 10.5667C1.64253 10.5053 1.77772 10.4736 1.91464 10.4737H16.0863C16.2231 10.4737 16.3582 10.5056 16.4816 10.567C16.6049 10.6284 16.7134 10.7177 16.7991 10.8283C16.8847 10.939 16.9452 11.0682 16.9762 11.2064C17.0072 11.3445 17.0079 11.4882 16.9782 11.6266L15.5567 18.2582C15.5115 18.4687 15.3985 18.6569 15.2363 18.7917C15.074 18.9266 14.8722 19.0001 14.6643 19H3.33574C3.12784 19 2.92617 18.9264 2.76401 18.7916C2.60185 18.6567 2.4889 18.4686 2.44378 18.2582L1.02223 11.6266H1.02178ZM7.46604 3.78953C8.11993 2.899 8.62439 1.66789 8.89673 1C9.37378 1.66789 10.4092 3.34379 10.7364 4.23479C11.1449 5.34795 10.1232 6.68421 8.89673 6.68421C7.6703 6.68421 6.64857 4.90316 7.46604 3.78953Z"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    СПА: Сауна, массаж, хаммам, арома{" "}
                                    <span>(платно)</span>
                                </p>

                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 24 12"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M2.90078 5.20039V2.50039H4.00078H4.50078V2.00039V0.900391H5.90078V5.20039V5.70039H6.40078H17.6008H18.1008V5.20039V0.900391H19.5008V2.00039V2.50039H20.0008H21.1008V5.20039V5.70039H21.6008H22.7008V6.30039H21.6008H21.1008V6.80039V9.50039H20.0008H19.5008V10.0004V11.1004H18.1008V6.80039V6.30039H17.6008H6.40078H5.90078V6.80039V11.1004H4.50078V10.0004V9.50039H4.00078H2.90078V6.80039V6.30039H2.40078H1.30078V5.70039H2.40078H2.90078V5.20039Z"
                                            stroke="#116E67"
                                        />
                                    </svg>
                                    Фитнес-центр
                                </p>
                            </div>
                        </div>
                        <div className="object-page-section-about-services-block">
                            <h3 className="object-page-section-about-services-block__title">
                                В каждом номере
                            </h3>
                            <div className="object-page-section-about-services-block-list">
                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 20 20"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M4 6.5H3C1.89543 6.5 1 7.39545 1 8.5C1 9.60455 1.89543 10.5 3 10.5H4"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                        <path
                                            d="M9 14.5H7.5C6.39545 14.5 5.5 15.3954 5.5 16.5C5.5 17.6046 6.39545 18.5 7.5 18.5H9"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                        <path
                                            d="M11.5 1.5H10C8.89545 1.5 8 2.39543 8 3.5C8 4.60455 8.89545 5.5 10 5.5H11.5"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                        <path
                                            d="M10 5.5H18"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                        <path
                                            d="M4 10.5H19"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                        <path
                                            d="M9 14.5H15"
                                            stroke="#116E67"
                                            strokeWidth="1.5"
                                            strokeLinecap="round"
                                            strokeLinejoin="round"
                                        />
                                    </svg>
                                    Кондиционер
                                </p>
                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 18 20"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M7 8V10H5V8H7ZM13 10V8H11V10H13ZM18 12V20H0V12H1V8C1 3.58 4.58 0 9 0C13.42 0 17 3.58 17 8V12H18ZM6 13.5H3H2V18.5H6V13.5ZM8 13.5H6V18.5H8V13.5ZM8 1.5C5.16 1.98 2.5 5.03 2.5 8V12H8V1.5ZM10 12H15.5V8C15.5 5.03 12.84 1.98 10 1.5V12ZM14 13.5H10V18.5H14V13.5ZM16 13.5H14V18.5H16V13.5Z"
                                            fill="#116E67"
                                        />
                                    </svg>
                                    Терраса / балкон
                                </p>
                                <p className="object-page-section-about-services-block-list__item">
                                    <svg
                                        viewBox="0 0 24 24"
                                        fill="none"
                                        xmlns="http://www.w3.org/2000/svg"
                                    >
                                        <path
                                            d="M22.125 4.14844H14.1856L17.5841 0.75H15.4628L12.0644 4.14844H11.9591L8.56064 0.75H6.43936L9.8378 4.14844H1.875C1.57674 4.14878 1.29079 4.26742 1.07989 4.47833C0.868985 4.68923 0.750347 4.97518 0.75 5.27344V19.1484C0.750347 19.4467 0.868985 19.7326 1.07989 19.9435C1.29079 20.1545 1.57674 20.2731 1.875 20.2734H7.125V23.25H17.625V20.2734H22.125C22.4233 20.2731 22.7092 20.1545 22.9201 19.9435C23.131 19.7326 23.2497 19.4467 23.25 19.1484V5.27344C23.2497 4.97518 23.131 4.68923 22.9201 4.47833C22.7092 4.26742 22.4233 4.14878 22.125 4.14844ZM16.125 21.75H8.625V20.2734H16.125V21.75ZM21.75 18.7734H2.25V5.64844H21.75V18.7734Z"
                                            fill="#116E67"
                                        />
                                    </svg>
                                    Телевизор
                                </p>
                            </div>
                        </div>
                    </div>

                    <p className="object-page-section-about-services__link">
                        Полный список удобств и услуг
                    </p>
                </div> */}
            </div>
        </div>
    );
};

export default ObjectPageAbout;
